[
  {
    "title": "IT Senior Developer",
    "company": "Avio Network d.o.o.",
    "location": "Surčin",
    "description": "...services using Java and Spring Boot Defining and maintaining microservices architecture and integration patterns Leading frontend development using React and coordinating UI architecture Designing and optimizing database schemas and queries Implementing and...",
    "link": "https://poslovi.infostud.com/posao/it-senior-developer/avio-network-doo/713217",
    "skills": [
      "MySQL",
      "Junior",
      "Spring",
      "Java",
      "Oracle",
      "Docker",
      "PostgreSQL",
      "Programiranje",
      "RESTful",
      "Microservices",
      "Spring Boot",
      "UI",
      "React"
    ],
    "scraped_at": "2026-02-12T01:55:24.810441",
    "evaluation": {
      "score": 54,
      "matches": [
        "Junior",
        "Java",
        "Spring",
        "Spring boot",
        "React"
      ],
      "gaps": [],
      "recommendation": "Good fit - apply! (54/100)"
    },
    "cover_letter": {
      "success": true,
      "cover_letter": "Dear Hiring Manager,\n\nI am thrilled to apply for the IT Senior Developer position at Avio Network d.o.o. As a recent computer science graduate with strong fundamentals in Java and web development, I am confident that my skills align well with your requirements.\n\nWith experience working on projects such as my internship management system using Spring Boot, Spring Data JPA, Spring Security, and React, I have developed a solid understanding of microservices architecture and integration patterns. Additionally, my coursework projects in core Java, JDBC, SQL, and multithreading have equipped me to design and optimize database schemas and queries.\n\nAs highlighted in my resume, I possess excellent programming skills in Java, JavaScript, and Python, as well as experience with frameworks like Spring Boot, React, and Laravel. Furthermore, I am proficient in databases such as PostgreSQL, MySQL, and MongoDB, and have worked with tools like Git, Maven, Docker, and IntelliJ.\n\nI am excited about the opportunity to join Avio Network d.o.o. and contribute my skills and enthusiasm to your dynamic team. Thank you for considering my application. I look forward to discussing how my qualifications can benefit your organization.\n\nSincerely,\nDragomir Vlacic",
      "job_title": "IT Senior Developer",
      "company": "Avio Network d.o.o."
    }
  },
  {
    "title": "Junior IT Developer",
    "company": "Avio Network d.o.o.",
    "location": "Beograd",
    "description": "...Main responsibilities: Assisting in the development of backend services using Java and Spring Boot Supporting microservices-based architectures Developing and maintaining frontend components using React Working with relational databases and...",
    "link": "https://poslovi.infostud.com/posao/junior-it-developer/avio-network-doo/713205",
    "skills": [
      "MySQL",
      "SQL",
      "Spring",
      "Java",
      "Oracle",
      "Docker",
      "PostgreSQL",
      "Programiranje",
      "Microservices",
      "Spring Boot",
      "React"
    ],
    "scraped_at": "2026-02-12T01:55:25.359343",
    "evaluation": {
      "score": 74,
      "matches": [
        "Junior",
        "Java",
        "Spring",
        "Spring boot",
        "React"
      ],
      "gaps": [],
      "recommendation": "Good fit - apply! (74/100)"
    },
    "cover_letter": {
      "success": true,
      "cover_letter": "Dear Hiring Manager,\n\nI am thrilled to apply for the Junior IT Developer position at Avio Network d.o.o. As a recent computer science graduate with strong fundamentals in Java and web development, I am confident that my skills align well with the requirements of this role.\n\nWith hands-on experience in developing full-stack applications using Spring Boot and React, I believe I would be an excellent fit for your team. My internship project, an internship management system, showcased my ability to design and implement a scalable architecture, leveraging technologies such as Spring Boot, Spring Data JPA, and PostgreSQL. Additionally, my coursework projects demonstrated my proficiency in Java, JDBC, SQL, and multithreading.\n\nI am particularly excited about the opportunity to work on backend services using Java and Spring Boot, supporting microservices-based architectures, and developing frontend components using React. My skills in relational databases, including PostgreSQL, also align well with your requirements. I am eager to bring my passion for software development and teamwork to Avio Network d.o.o.\n\nThank you for considering my application. I would be delighted to discuss this opportunity further. Please feel free to contact me at dragomir.r.vlacic@gmail.com or 063240727.\n\nSincerely,\nDragomir Vlacic",
      "job_title": "Junior IT Developer",
      "company": "Avio Network d.o.o."
    }
  }
]